app/views/honeys/index.html.erb

        <td><%= honey.reciept %></td>
        <td><%= link_to raw("<i class='pull-right icon-chevron-right'></i> #{honey.honey_order.count}#{"Orders"} "),honey_honey_orders_path(honey)  %></td>
---
SELECT "honeys".* FROM "honeys"
SELECT COUNT(*) FROM "honey_orders" WHERE "honey_orders"."honey_id" = ?  [["honey_id", 1]]