app/views/eggs/index.html.erb

SELECT "eggs".* FROM "eggs"
SELECT COUNT(*) FROM "egg_orders" WHERE "egg_orders"."egg_id" = ?  [["egg_id", 1]]
---
        <td><%= egg.reciept %></td>
        <td> <%= link_to raw("<i class='pull-right icon-chevron-right'></i> #{egg.egg_order.count}#{"Orders"} ")  %></td>