app/views/milks/index.html.erb

SELECT "milks".* FROM "milks"
---
        <td><%= milk.reciept %></td>
          <% milk.milk_orders.each do |milk_order|

SELECT COUNT(*) FROM "milk_orders" WHERE "milk_orders"."milk_id" = ?  [["milk_id", 1]]
---
        <% if can? :edit, milk %>
          <td><%= link_to raw("<i class='pull-right icon-chevron-right'></i> #{milk.milk_orders.count}#{"Orders"} "),milk_milk_orders_path(milk)  %></td>