app/controllers/egg_orders_controller.rb

SELECT "eggs".* FROM "eggs" WHERE "eggs"."id" = ? ORDER BY "eggs"."id" ASC LIMIT 1  [["id", 4]]
---
  def index
    #1st you retrieve the post thanks to params[:post_id]
    @egg = Egg.find(params[:egg_id])

SELECT "eggs".* FROM "eggs" WHERE "eggs"."id" = ? ORDER BY "eggs"."id" ASC LIMIT 1  [["id", 4]]
SELECT "egg_orders".* FROM "egg_orders" WHERE "egg_orders"."egg_id" = ? AND "egg_orders"."id" = ? LIMIT 1  [["egg_id", 4], ["id", "1"]]
---
  def show
    #1st you retrieve the post thanks to params[:post_id]
    egg = Egg.find(params[:egg_id])
    #2nd you retrieve the comment thanks to params[:id]
    @eggorder = egg.egg_order.find(params[:id])

SELECT "eggs".* FROM "eggs" WHERE "eggs"."id" = ? ORDER BY "eggs"."id" ASC LIMIT 1  [["id", 2]]
---
  def new
    #1st you retrieve the post thanks to params[:post_id]
    egg = Egg.find(params[:egg_id])

SELECT "eggs".* FROM "eggs" WHERE "eggs"."id" = ? ORDER BY "eggs"."id" ASC LIMIT 1  [["id", 4]]
INSERT INTO "egg_orders" ("company", "created_at", "daily_quantity", "egg_id", "location", "price", "tel", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #1st you retrieve the post thanks to params[:post_id]
    egg = Egg.find(params[:egg_id])
    #2nd you create the comment with arguments in params[:comment]
    @eggorder = egg.egg_order.create(egg_order_params)

SELECT "egg_orders".* FROM "egg_orders" WHERE "egg_orders"."egg_id" = ?  [[nil, 19]]
---
    def set_egg_order
      @egg_order = EggOrder.find(params[:id])