app/controllers/eggs_controller.rb

  def index
    @eggs = Egg.all
---
SELECT "eggs".* FROM "eggs"

  def create
    @egg = Egg.new(egg_params)
    @egg.user = current_user
    @egg.company = current_user.company_name





    respond_to do |format|
      if @egg.save
---
INSERT INTO "eggs" ("company", "created_at", "daily_quantity", "location", "price", "reciept", "tel", "type_of_egg", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_egg
      @egg = Egg.find(params[:id])
---
SELECT "eggs".* FROM "eggs" WHERE "eggs"."id" = ? LIMIT 1  [["id", "1"]]