app/controllers/honey_orders_controller.rb

  def show
    #1st you retrieve the post thanks to params[:post_id]
  @honey_order_count = @honey.honey_orders.count('user_id', :value => current_user.id)
---
SELECT "honeys".* FROM "honeys"