app/controllers/honey_orders_controller.rb

  def index
    #1st you retrieve the post thanks to params[:post_id]
    @honey = Honey.find(params[:honey_id])
---
SELECT "honeys".* FROM "honeys" WHERE "honeys"."id" = ? ORDER BY "honeys"."id" ASC LIMIT 1  [["id", 1]]

  def show
    #1st you retrieve the post thanks to params[:post_id]
    honey = Honey.find(params[:honey_id])
    #2nd you retrieve the comment thanks to params[:id]
    @honey_order = honey.honey_orders.find(params[:id])
---
SELECT "honeys".* FROM "honeys" WHERE "honeys"."id" = ? ORDER BY "honeys"."id" ASC LIMIT 1  [["id", 1]]
SELECT "honey_orders".* FROM "honey_orders" WHERE "honey_orders"."honey_id" = ? AND "honey_orders"."id" = ? LIMIT 1  [["honey_id", 1], ["id", "2"]]

  def new
    #1st you retrieve the post thanks to params[:post_id]
    honey = Honey.find(params[:honey_id])
---
SELECT "honeys".* FROM "honeys" WHERE "honeys"."id" = ? ORDER BY "honeys"."id" ASC LIMIT 1  [["id", 1]]

  def create
    #1st you retrieve the post thanks to params[:post_id]
    honey = Honey.find(params[:honey_id])
    #2nd you create the comment with arguments in params[:comment]
    @honey_order = honey.honey_orders.create(honey_order_params)
---
SELECT "honeys".* FROM "honeys" WHERE "honeys"."id" = ? ORDER BY "honeys"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "honey_orders" ("amount", "company", "created_at", "honey_id", "location", "price", "tel", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_honey_order
      @Honey_order = HoneyOrder.find(params[:id])
---
SELECT "honey_orders".* FROM "honey_orders" WHERE "honey_orders"."honey_id" = ?  [["honey_id", 1]]