app/controllers/honeys_controller.rb

  def index
    @honeys = Honey.all
---
SELECT "honeys".* FROM "honeys"

  def create
    @honey = Honey.new(honey_params)
    @honey.user = current_user
    @honey.company = current_user.company_name





    respond_to do |format|
      if @honey.save
---
INSERT INTO "honeys" ("amount", "company", "condition", "created_at", "honey_type", "location", "price", "reciept", "tel", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_honey
      @honey = Honey.find(params[:id])
---
SELECT "honeys".* FROM "honeys" WHERE "honeys"."id" = ? LIMIT 1  [["id", "1"]]