app/controllers/milk_orders_controller.rb

SELECT "milks".* FROM "milks" WHERE "milks"."id" = ? ORDER BY "milks"."id" ASC LIMIT 1  [["id", 1]]
---
  def index
    #1st you retrieve the post thanks to params[:post_id]
    @milk = Milk.find(params[:milk_id])

SELECT "milks".* FROM "milks" WHERE "milks"."id" = ? ORDER BY "milks"."id" ASC LIMIT 1  [["id", 1]]
SELECT "milk_orders".* FROM "milk_orders" WHERE "milk_orders"."milk_id" = ? AND "milk_orders"."id" = ? LIMIT 1  [["milk_id", 1], ["id", "1"]]
---
  def show
    #1st you retrieve the post thanks to params[:post_id]
    milk = Milk.find(params[:milk_id])
    #2nd you retrieve the comment thanks to params[:id]
    @milk_order = milk.milk_orders.find(params[:id])

SELECT "milks".* FROM "milks" WHERE "milks"."id" = ? ORDER BY "milks"."id" ASC LIMIT 1  [["id", 1]]
---
  def new
    #1st you retrieve the post thanks to params[:post_id]
    milk = Milk.find(params[:milk_id])

SELECT "milks".* FROM "milks" WHERE "milks"."id" = ? ORDER BY "milks"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "milk_orders" ("company", "created_at", "daily_quantity", "location", "milk_id", "price", "tel", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #1st you retrieve the post thanks to params[:post_id]
    milk = Milk.find(params[:milk_id])
    #2nd you create the comment with arguments in params[:comment]
    @milk_order = milk.milk_orders.create(milk_order_params)

SELECT "milk_orders".* FROM "milk_orders" WHERE "milk_orders"."milk_id" = ?  [["milk_id", 1]]
---
    def set_milk_order
      @milk_order = MilkOrder.find(params[:id])