app/controllers/milks_controller.rb

SELECT "milks".* FROM "milks"
---
  def index
    @milks = Milk.all

INSERT INTO "milks" ("company", "condition", "created_at", "daily_quantity", "location", "price", "reciept", "tel", "updated_at", "user") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @milk = Milk.new(milk_params)

    @milk.user = current_user.user_name
    @milk.company = current_user.company_name
    @milk.tel = current_user.tel


    respond_to do |format|
      if @milk.save

SELECT "milks".* FROM "milks" WHERE "milks"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_milk
      @milk = Milk.find(params[:id])